[
    {
      "name": "VOLTRX Premium Electric Protein Shaker Bottle",
      "image": "/images/shakercup.webp",
      "price": "$25.98",
      "description": "The VOLTRX VortexBoost mixing bottle is a high-quality shaker bottle made of Tritan that is safe and shatter-resistant with no BPA. It has a unique and eye-catching design, a 24oz capacity, and a powerful motor that ensures no remaining chunks.",
      "buttonText": "Add to Cart"
    },
    
    {
      "name": "Beats Powerbeats Pro",
      "image": "/images/beats.webp",
      "price": "$189.99",
      "description": "Black Wireless Earbuds with Apple H1 Headphone Chip, Class 1 Bluetooth Headphones, 9 Hours of Listening Time, Sweat Resistant, Built-in Microphone",
      "buttonText": "Add to Cart"
    },

    {
        "name": "CANWAY Foldable Sports Gym Bag",
        "image": "/images/bag.webp",
        "price": "$30.99",
        "description": "Travel Duffel Bag with Shoes Compartment, Carry onBags for Airplanes, Weekender Overnight Workout Bag with Waterproof, Black",
        "buttonText": "Add to Cart"
      },
      {
        "name": "YQXCC 4 Pack Cooling Towel",
        "image": "/images/towel.webp",
        "price": "$14.99",
        "description": "Cool Cold Towel for Neck, Microfiber Ice Towel, Soft Breathable Chilly Towel for Yoga, Golf, Gym, Camping, Running, Workout & More Activities",
        "buttonText": "Add to Cart"
      },
      {
        "name": "NELEUS Men's 3 Pack Dry Fit",
        "image": "/images/ytop.webp",
        "price": "$23.95",
        "description": "The Y-back design is ideal for bodybuilders, gym enthusiasts, and men with muscular athletic physiques. The fitted design allows for a comfortable fit and natural range of motion, while also providing room to breathe and stay cool.",
        "buttonText": "Add to Cart"
      },
      {
        "name": "Anime Shorts",
        "image": "/images/anime.webp",
        "price": "$34.99",
        "description": "These anime-inspired shorts are made of 100% polyester with moisture-wicking technology that absorbs moisture and removes odor. They are versatile and suitable for gym, marathon, or lounge days.",
        "buttonText": "Add to Cart"
      },
      {
        "name": "DEATH CAN WAIT OVERSIZED TEE",
        "image": "/images/wolves.webp",
        "price": "$40",
        "description": "The Premium Vintage Tee is an oversized, incredibly soft t-shirt made of 100% cotton. It's designed for everyday wear and has been pre-shrunk, softened, and dyed to give it an authentic vintage finish. The tee comes with a screen print and is part of a label called Premium Vintage that reinvents past garments for the present, creating timeless pieces.",
        "buttonText": "Add to Cart"
      },
      
      {
        "name": "Ultra Performance 3 Pack",
        "image": "/images/sweats.webp",
        "price": "$36.99",
        "description": "These lightweight mens sweatpants with pockets are perfect for lounging around the house. You never know what the day will throw at you, that is why it feels great to be prepared with clothes like these mens lounge pants with pockets that are ideal in any situation.",
        "buttonText": "Add to Cart"
      },
  
      {
          "name": "Body Reapers Weight Lifting Belt",
          "image": "/images/belt.webp",
          "price": "$59.99",
          "description": "Weight Lifting Belt for Men & Women, Heavy Duty Lever Belt Weightlifting Belt Made of Calfskin Leather 10mm Thick, 4 Inch Wide - Powerlifting Belt for Back Support, Gym & Fitness Training",
          "buttonText": "Add to Cart"
        },
        {
          "name": "Nike Blazer",
          "image": "/images/nike.webp",
          "price": "$112",
          "description": "VINTAGE STYLE. The Nike Blazer Mid 77 Vintage combines old-school basketball style with the vintage finish of the midsole, while innovative details update the look. Reinforced structure that blends the midsole to the sole for an essential look. Foam exposed on the tongue for a vintage style.",
          "buttonText": "Add to Cart"
        },
        {
          "name": "Gymreapers Knee Sleeves",
          "image": "/images/knee.webp",
          "price": "$59.99",
          "description": "Knee Sleeve & Compression Brace for Squats, Fitness, Weightlifting, and Powerlifting. Gymreapers 7MM Sleeve Pair For Men & Women",
          "buttonText": "Add to Cart"
        },
        {
          "name": "Gymreapers Wrist Wraps",
          "image": "/images/straps.webp",
          "price": "$19.99",
          "description": "18 inches Professional Quality Wrist Support with Heavy Duty Thumb Loop. Best Wrap for Powerlifting Competition, Strength Training, Bodybuilding",
          "buttonText": "Add to Cart"
        }
  ]
  